# n = 1.89

# print(n)

# n = 'fddf'

# print(n)

# n1 = "vbbbv"

# print('Ввидите первое число: ')
# a = input()

# b = input('Введите второе число:')
# print(a)

c = 5.89
print(c)
n = int(c)
print(n)

a = 5.89956
b= 6.5656
print(round(a*b, 2))


# введите два числа и определите больше

# firstn = input('First')
# secn = int('sec')

# firstn = 500
# secn = 5

# print(type(firstn),type(secn),firstn(secn))

# print(max(firstn, secn))

# print (firstn > scen)

# if firstn == secn:
#     print("=")
# elif firstn > secn:
#     print(firstn)
# else:
#     print(secn)

# За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m километров? При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.
# Input:
# n = 700
# m = 750
# Output:
# 2


# Решение в группах
# В некоторой школе решили набрать три новых
# математических класса и оборудовать кабинеты для
# них новыми партами. За каждой партой может сидеть
# два учащихся. Известно количество учащихся в
# каждом из трех классов. Выведите наименьшее
# число парт, которое нужно приобрести для них.
# Input: 20 21 22(ввод чисел НЕ в одну строку)
# Output: 32




# a = int(input('Введите первое число: '))
# b = int(input('Введите второе число: '))
# c = int(input('Введите третье число: '))

# s1=((a+1)//2)
# s2=(b//2+(b%2!=0))
# s3=abс(-c//2)

# print(s1+s2+s3)

# Дано натуральное число. Требуется определить,
# является ли год с данным номером високосным. Если
# год является високосным, то выведите YES, иначе
# выведите NO. Напомним, что в соответствии с
# григорианским календарем, год является
# високосным, если его номер кратен 4, но не кратен
# 100, а также если он кратен 400.
# Input: 2016
# Output: YES

# year = int(input("Введите год: "))
# if year % 400 == 0 or (year % 4 == 0 and year % 100 != 0):
#     print("YES")
# else:
#     print("NO")


# Решение в группах
# Вагоны в электричке пронумерованы натуральными
# числами, начиная с 1 (при этом иногда вагоны
# нумеруются от «головы» поезда, а иногда – с
# «хвоста»; это зависит от того, в какую сторону едет
# электричка). В каждом вагоне написан его номер.
# Витя сел в i-й вагон от головы поезда и обнаружил,
# что его вагон имеет номер j. Он хочет определить,
# сколько всего вагонов в электричке. Напишите
# программу, которая будет это делать или сообщать,
# что без дополнительной информации это сделать
# невозможно.
# Input: 3 4(ввод на разных строках)
# Output: 6


